In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv(r'I:\Text Datasets\CSV\titanic.csv')

In [3]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### Measure of Central Tendency
- Measure of central tendency used to find the averages of data four basic terms to find measure of central tendecy
 - Mean
 - Median
 - Mode
 - Midrange

#### Mean
- Mean is the average of any data

In [4]:
#Simple Pandas Function
df.Age.mean()

29.69911764705882

#### Median
- Median is the central value of data

In [5]:
#Finding the median
age=df.Age.sort_values()
mid=np.round(age.shape[0]*0.5,0)
median=age.loc[mid]
median

13.0

#### Mode
- mode is value which occur more time 
  - different types are
      - Unimode
          - Unimode in which a single value repeat many time as 1,2,2,4,5,6
          
      - Bimode
          - Bimode in which two values repeat two time as 1,2,2,3,55,64,3
      - Manymode
          - in manymode manyva

In [17]:
# Value counts will sort values with its frequency and head(1) will fetch first as value and its count
df['Fare'].value_counts().head(1)

# 8.05 value 43 is counts

8.05    43
Name: Fare, dtype: int64

#### Midrange 
- Midrange is mean of highest and lowest value (highest - lowest)/2

In [18]:
(df.Fare.max()-df.Fare.min())/2

256.1646